lib/tasks/create_initial_histories.rake

SELECT "attendances".* FROM "attendances" ORDER BY "attendances"."id" ASC LIMIT 1000
SELECT 1 AS one FROM "attendance_histories" WHERE "attendance_histories"."attendance_id" = 1 LIMIT 1
INSERT INTO "attendance_histories" ("attendance_id", "status", "message", "child_name", "date", "parent_name", "changed_by", "changed_at", "created_at", "updated_at") VALUES (7, '欠席', '発熱のため', 'ヤマダ コタロウ', '2025-07-08', 'ヤマダ タロウ', 'parent', '2025-07-08 05:15:38.210634', '2025-07-08 06:34:24.666451', '2025-07-08 06:34:24.666451') RETURNING "id"
---
  task create_initial_histories: :environment do
    puts "既存の出欠席データに対して初期の変更履歴を作成しています..."

    Attendance.find_each do |attendance|
      # 既に変更履歴がある場合はスキップ
      next if attendance.attendance_histories.exists?

      # parent_nameが空の場合はスキップ
      next if attendance.parent_name.blank?

      # 初期の変更履歴を作成（作成時点での状態）
      attendance.attendance_histories.create!(
        status: attendance.status,
        message: attendance.message,
        child_name: attendance.child_name,
        date: attendance.date,
        parent_name: attendance.parent_name,
        changed_by: 'parent', # 初期データは保護者による作成と仮定
        changed_at: attendance.created_at
      )