app/views/admins/dashboard.html.erb

SELECT "attendances".* FROM "attendances" ORDER BY "attendances"."created_at" DESC LIMIT 10
---
          <ul class="divide-y divide-gray-200">
            <% Attendance.order(created_at: :desc).limit(10).each do |attendance| %>