app/views/parents/dashboard.html.erb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ ハナコの子供' ORDER BY "attendances"."created_at" DESC LIMIT 5
---
          <ul class="divide-y divide-gray-200">
            <% Attendance.where(child_name: "#{@user_name}の子供").order(created_at: :desc).limit(5).each do |attendance| %>