app/controllers/admins_controller.rb

  def dashboard
    @user_name = session[:user_name]
    @total_attendances = Attendance.count
    @today_attendances = Attendance.where(date: Date.current).count
---
SELECT COUNT(*) FROM "attendances"
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."date" = '2025-07-07'

  def attendances
    @user_name = session[:user_name]
    @attendances = Attendance.where(date: Date.current).order(created_at: :desc)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."date" = '2025-07-07' ORDER BY "attendances"."created_at" DESC

  def all_attendances
    @user_name = session[:user_name]
    @attendances = Attendance.order(created_at: :desc)
---
SELECT "attendances".* FROM "attendances" ORDER BY "attendances"."created_at" DESC