app/controllers/attendances_controller.rb

UPDATE "attendances" SET "status" = '早退', "message" = '早退にします', "updated_at" = '2025-07-08 05:37:15.423488' WHERE "attendances"."id" = 8
---
  def update
    @attendance = Attendance.find(params[:id])

    # 子供の姓と名を組み合わせてchild_nameに保存
    if attendance_params[:child_last_name].present? && attendance_params[:child_first_name].present?
      child_name = "#{attendance_params[:child_last_name]} #{attendance_params[:child_first_name]}"
    end

    if @attendance.update(attendance_params.merge(child_name: child_name))

INSERT INTO "attendances" ("child_name", "status", "date", "message", "created_at", "updated_at", "child_first_name", "child_last_name", "parent_name") VALUES ('ヤマダ アイ', '出席', '2025-07-08', 'やっぱり行きます', '2025-07-08 05:55:54.394032', '2025-07-08 05:55:54.394032', 'アイ', 'ヤマダ', 'ヤマダ タロウ') RETURNING "id"
---
  def create
    @attendance = Attendance.new(attendance_params)

    # 子供の姓と名を組み合わせてchild_nameに保存
    if @attendance.child_last_name.present? && @attendance.child_first_name.present?
      @attendance.child_name = "#{@attendance.child_last_name} #{@attendance.child_first_name}"
    end

    # 保護者の名前を保存
    @attendance.parent_name = session[:user_name] if session[:user_name].present?

    # 同じ日付の既存の送信があるかチェック
    existing_attendance = check_existing_attendance

    if existing_attendance
      # 既存の送信がある場合は、更新オプションを提供
      @existing_attendance = existing_attendance
      @show_update_option = true
      render :new, status: :unprocessable_entity
    elsif @attendance.save

SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ アイ' AND "attendances"."date" = '2025-07-09' AND "attendances"."parent_name" = 'ヤマダ タロウ' ORDER BY "attendances"."id" ASC LIMIT 1
---
  def check_existing_attendance
    return nil unless @attendance.child_name.present? && @attendance.date.present? && @attendance.parent_name.present?

    Attendance.where(
      child_name: @attendance.child_name,
      date: @attendance.date,
      parent_name: @attendance.parent_name
    ).first