app/controllers/attendances_controller.rb

  def edit
    @attendance = Attendance.find(params[:id])
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = 8 LIMIT 1

  def history
    @attendance = Attendance.find(params[:id])
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = 8 LIMIT 1

  def update
    @attendance = Attendance.find(params[:id])

    # セッションにユーザーの役割を保存（変更履歴用）
    session[:user_role] = current_user_role

    # 子供の姓と名を組み合わせてchild_nameに保存
    child_name = nil
    if attendance_params[:child_last_name].present? && attendance_params[:child_first_name].present?
      child_name = "#{attendance_params[:child_last_name]} #{attendance_params[:child_first_name]}"
    end

    # 更新用のパラメータを準備
    update_params = attendance_params.dup
    update_params[:child_name] = child_name if child_name.present?

    # デバッグ情報
    Rails.logger.info "Update params: #{update_params}"
    Rails.logger.info "Child name: #{child_name}"

    if @attendance.update(update_params)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = 11 LIMIT 1
UPDATE "attendances" SET "status" = '出席', "message" = 'やはり出席します', "updated_at" = '2025-07-08 06:37:58.637934' WHERE "attendances"."id" = 11

  def create
    @attendance = Attendance.new(attendance_params)

    # 子供の姓と名を組み合わせてchild_nameに保存
    if @attendance.child_last_name.present? && @attendance.child_first_name.present?
      @attendance.child_name = "#{@attendance.child_last_name} #{@attendance.child_first_name}"
    end

    # 保護者の名前を保存
    @attendance.parent_name = session[:user_name] if session[:user_name].present?

    # デバッグ情報（本番環境では削除）
    Rails.logger.info "Creating attendance: #{@attendance.attributes}"
    Rails.logger.info "Session user_name: #{session[:user_name]}"

    # 同じ日付の既存の送信があるかチェック
    existing_attendance = check_existing_attendance

    if existing_attendance
      # 既存の送信がある場合は、更新オプションを提供
      @existing_attendance = existing_attendance
      @show_update_option = true
      render :new, status: :unprocessable_entity
    elsif @attendance.save
---
INSERT INTO "attendances" ("child_name", "status", "date", "message", "created_at", "updated_at", "child_first_name", "child_last_name", "parent_name") VALUES ('ヤマダ アイ', '欠席', '2025-07-08', '', '2025-07-08 06:17:56.724614', '2025-07-08 06:17:56.724614', 'アイ', 'ヤマダ', 'ヤマダ タロウ') RETURNING "id"

  def update_existing
    existing_attendance = Attendance.find(params[:id])
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = 7 LIMIT 1

  def index
    if current_user_role == "parent"
      # 保護者は保護者専用の出欠席一覧ページにリダイレクト
      redirect_to parent_attendances_path
    else
      # 管理者は全児童の出欠を表示
      if params[:child_name].present?
        @attendances = Attendance.where(child_name: params[:child_name]).order(created_at: :desc)
        @child_name = params[:child_name]
      else
        @attendances = Attendance.order(created_at: :desc)
---
SELECT "attendances".* FROM "attendances" ORDER BY "attendances"."created_at" DESC

  def check_existing_attendance
    return nil unless @attendance.child_name.present? && @attendance.date.present? && @attendance.parent_name.present?

    Attendance.where(
      child_name: @attendance.child_name,
      date: @attendance.date,
      parent_name: @attendance.parent_name
    ).first
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ アイ' AND "attendances"."date" = '2025-07-08' AND "attendances"."parent_name" = 'ヤマダ タロウ' ORDER BY "attendances"."id" ASC LIMIT 1