app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("child_name", "status", "date", "message", "created_at", "updated_at", "child_first_name", "child_last_name") VALUES ('ヤマダ ジロウ', '欠席', '2025-07-08', '発熱のため欠席します', '2025-07-08 05:00:19.184148', '2025-07-08 05:00:19.184148', 'ジロウ', 'ヤマダ') RETURNING "id"
---
  def create
    @attendance = Attendance.new(attendance_params)

    # 子供の姓と名を組み合わせてchild_nameに保存
    if @attendance.child_last_name.present? && @attendance.child_first_name.present?
      @attendance.child_name = "#{@attendance.child_last_name} #{@attendance.child_first_name}"
    end

    if @attendance.save