app/controllers/parents_controller.rb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."parent_name" = 'ヤマダ タロウ' ORDER BY "attendances"."created_at" DESC
---
  def attendances
    @user_name = session[:user_name]
    # 現在ログインしている保護者が送信した出欠席履歴を取得
    all_attendances = Attendance.where(parent_name: @user_name).order(created_at: :desc)

    # 子供の名前ごとにグループ化
    @attendances_by_child = all_attendances.group_by(&:child_name)