app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    # 保護者の場合、姓と名を組み合わせてnameに保存
    if @user.role == "parent" && @user.first_name.present? && @user.last_name.present?
      @user.name = "#{@user.last_name} #{@user.first_name}"
    end

    if @user.save
---
INSERT INTO "users" ("name", "password", "role", "created_at", "updated_at", "phone", "email", "first_name", "last_name") VALUES ('ヤマダ タロウ', '123abc', 'parent', '2025-07-08 05:10:12.375220', '2025-07-08 05:10:12.375220', '09094133398', 'yykm666@gmail.com', 'タロウ', 'ヤマダ') RETURNING "id"