app/models/attendance.rb

  def prevent_duplicate_attendance
    return unless child_name.present? && date.present? && parent_name.present?

    existing_attendance = Attendance.where(
      child_name: child_name,
      date: date,
      parent_name: parent_name
    ).first
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ アイ' AND "attendances"."date" = '2025-07-08' AND "attendances"."parent_name" = 'ヤマダ タロウ' ORDER BY "attendances"."id" ASC LIMIT 1