app/models/attendance.rb

INSERT INTO "attendance_histories" ("attendance_id", "status", "message", "child_name", "date", "parent_name", "changed_by", "changed_at", "created_at", "updated_at") VALUES (11, '出席', 'やはり出席します', 'ヤマダ ジロウ', '2025-07-08', 'ヤマダ タロウ', 'parent', '2025-07-08 06:37:58.639035', '2025-07-08 06:37:58.639639', '2025-07-08 06:37:58.639639') RETURNING "id"
---
  def create_history_record
    attendance_histories.create!(
      status: status,
      message: message,
      child_name: child_name,
      date: date,
      parent_name: parent_name,
      changed_by: determine_changed_by,
      changed_at: Time.current
    )

SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ アイ' AND "attendances"."date" = '2025-07-09' AND "attendances"."parent_name" = 'ヤマダ タロウ' AND "attendances"."id" != 9 ORDER BY "attendances"."id" ASC LIMIT 1
---
  def prevent_duplicate_attendance
    return unless child_name.present? && date.present? && parent_name.present?

SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_name" = 'ヤマダ ジロウ' AND "attendances"."date" = '2025-07-08' AND "attendances"."parent_name" = 'ヤマダ タロウ' AND "attendances"."id" != 11 ORDER BY "attendances"."id" ASC LIMIT 1
---
  def prevent_duplicate_attendance_on_update
    return unless child_name.present? && date.present? && parent_name.present?

    # 自分以外の同じ条件のレコードを検索
    existing_attendance = Attendance.where(
      child_name: child_name,
      date: date,
      parent_name: parent_name
    ).where.not(id: id).first