app/models/user.rb

  def full_name
    if first_name.present? && last_name.present?
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'ヤマダ ハナコ' LIMIT 1